program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "5.33.5"}, {"coremlc-version", "1877.40.3"}, {"coremltools-component-torch", "2.2.1"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.1"}})]
{
    func main<ios16>(tensor<fp16, [1, 80, 1, 3000]> melspectrogram_features) {
            tensor<int32, [2]> var_50 = const()[name = tensor<string, []>("op_50"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_56 = const()[name = tensor<string, []>("op_56"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_61 = const()[name = tensor<string, []>("op_61"), val = tensor<int32, []>(1)];
            tensor<string, []> var_66_pad_type_0 = const()[name = tensor<string, []>("op_66_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_66_pad_0 = const()[name = tensor<string, []>("op_66_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<fp16, [768, 80, 1, 3]> var_41_to_fp16 = const()[name = tensor<string, []>("op_41_to_fp16"), val = tensor<fp16, [768, 80, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [768]> var_47_to_fp16 = const()[name = tensor<string, []>("op_47_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(368768)))];
            tensor<fp16, [1, 768, 1, 3000]> var_66_cast_fp16 = conv(bias = var_47_to_fp16, dilations = var_56, groups = var_61, pad = var_66_pad_0, pad_type = var_66_pad_type_0, strides = var_50, weight = var_41_to_fp16, x = melspectrogram_features)[name = tensor<string, []>("op_66_cast_fp16")];
            tensor<string, []> hidden_states_1_mode_0 = const()[name = tensor<string, []>("hidden_states_1_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 768, 1, 3000]> hidden_states_1_cast_fp16 = gelu(mode = hidden_states_1_mode_0, x = var_66_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<int32, [2]> var_90 = const()[name = tensor<string, []>("op_90"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_96 = const()[name = tensor<string, []>("op_96"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> var_101 = const()[name = tensor<string, []>("op_101"), val = tensor<int32, []>(1)];
            tensor<string, []> var_106_pad_type_0 = const()[name = tensor<string, []>("op_106_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> var_106_pad_0 = const()[name = tensor<string, []>("op_106_pad_0"), val = tensor<int32, [4]>([0, 0, 1, 1])];
            tensor<fp16, [768, 768, 1, 3]> var_81_to_fp16 = const()[name = tensor<string, []>("op_81_to_fp16"), val = tensor<fp16, [768, 768, 1, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(370368)))];
            tensor<fp16, [768]> var_87_to_fp16 = const()[name = tensor<string, []>("op_87_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3909376)))];
            tensor<fp16, [1, 768, 1, 1500]> var_106_cast_fp16 = conv(bias = var_87_to_fp16, dilations = var_96, groups = var_101, pad = var_106_pad_0, pad_type = var_106_pad_type_0, strides = var_90, weight = var_81_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("op_106_cast_fp16")];
            tensor<string, []> hidden_states_3_mode_0 = const()[name = tensor<string, []>("hidden_states_3_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 768, 1, 1500]> hidden_states_3_cast_fp16 = gelu(mode = hidden_states_3_mode_0, x = var_106_cast_fp16)[name = tensor<string, []>("hidden_states_3_cast_fp16")];
            tensor<fp16, [1, 768, 1, 1500]> var_124_to_fp16 = const()[name = tensor<string, []>("op_124_to_fp16"), val = tensor<fp16, [1, 768, 1, 1500]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3910976)))];
            tensor<fp16, [1, 768, 1, 1500]> inputs_1_cast_fp16 = add(x = hidden_states_3_cast_fp16, y = var_124_to_fp16)[name = tensor<string, []>("inputs_1_cast_fp16")];
            tensor<int32, []> var_134 = const()[name = tensor<string, []>("op_134"), val = tensor<int32, []>(3)];
            tensor<int32, []> var_151 = const()[name = tensor<string, []>("op_151"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_152 = const()[name = tensor<string, []>("op_152"), val = tensor<bool, []>(true)];
            tensor<int32, [1]> var_162 = const()[name = tensor<string, []>("op_162"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> channels_mean_1_cast_fp16 = reduce_mean(axes = var_162, keep_dims = var_152, x = inputs_1_cast_fp16)[name = tensor<string, []>("channels_mean_1_cast_fp16")];
            tensor<fp16, [1, 768, 1, 1500]> zero_mean_1_cast_fp16 = sub(x = inputs_1_cast_fp16, y = channels_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_1_cast_fp16")];
            tensor<fp16, [1, 768, 1, 1500]> zero_mean_sq_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = zero_mean_1_cast_fp16)[name = tensor<string, []>("zero_mean_sq_1_cast_fp16")];
            tensor<int32, [1]> var_166 = const()[name = tensor<string, []>("op_166"), val = tensor<int32, [1]>([1])];
            tensor<fp16, [1, 1, 1, 1500]> var_167_cast_fp16 = reduce_mean(axes = var_166, keep_dims = var_152, x = zero_mean_sq_1_cast_fp16)[name = tensor<string, []>("op_167_cast_fp16")];
            tensor<fp16, []> var_168_to_fp16 = const()[name = tensor<string, []>("op_168_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 1, 1, 1500]> var_169_cast_fp16 = add(x = var_167_cast_fp16, y = var_168_to_fp16)[name = tensor<string, []>("op_169_cast_fp16")];
            tensor<fp16, []> denom_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("denom_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1p-24)];
            tensor<fp16, [1, 1, 1, 1500]> denom_1_cast_fp16 = rsqrt(epsilon = denom_1_epsilon_0_to_fp16, x = var_169_cast_fp16)[name = tensor<string, []>("denom_1_cast_fp16")];
            tensor<fp16, [1, 768, 1, 1500]> out_1_cast_fp16 = mul(x = zero_mean_1_cast_fp16, y = denom_1_cast_fp16)[name = tensor<string, []>("out_1_cast_fp16")];
            tensor<fp16, [768]> obj_1_mean_0_to_fp16 = const()[name = tensor<string, []>("obj_1_mean_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6215040)))];
            tensor<fp16, [768]> obj_1_variance_0_to_fp16 = const()[name = tensor<string, []>("obj_1_variance_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6216640)))];
            tensor<fp16, [768]> obj_1_gamma_0_to_fp16 = const()[name = tensor<string, []>("obj_1_gamma_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6218240)))];
            tensor<fp16, [768]> obj_1_beta_0_to_fp16 = const()[name = tensor<string, []>("obj_1_beta_0_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6219840)))];
            tensor<fp16, []> obj_1_epsilon_0_to_fp16 = const()[name = tensor<string, []>("obj_1_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 768, 1, 1500]> obj_1_cast_fp16 = batch_norm(beta = obj_1_beta_0_to_fp16, epsilon = obj_1_epsilon_0_to_fp16, gamma = obj_1_gamma_0_to_fp16, mean = obj_1_mean_0_to_fp16, variance = obj_1_variance_0_to_fp16, x = out_1_cast_fp16)[name = tensor<string, []>("obj_1_cast_fp16")];
            tensor<int32, [2]> var_184 = const()[name = tensor<string, []>("op_184"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_186 = const()[name = tensor<string, []>("op_186"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> query_1_pad_type_0 = const()[name = tensor<string, []>("query_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> query_1_pad_0 = const()[name = tensor<string, []>("query_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [768, 768, 1, 1]> layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [768, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6221440)))];
            tensor<fp16, [768]> layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7401152)))];
            tensor<fp16, [1, 768, 1, 1500]> query_1_cast_fp16 = conv(bias = layers_0_self_attn_q_proj_bias_to_fp16, dilations = var_186, groups = var_151, pad = query_1_pad_0, pad_type = query_1_pad_type_0, strides = var_184, weight = layers_0_self_attn_q_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("query_1_cast_fp16")];
            tensor<int32, [2]> var_190 = const()[name = tensor<string, []>("op_190"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_192 = const()[name = tensor<string, []>("op_192"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> key_1_pad_type_0 = const()[name = tensor<string, []>("key_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> key_1_pad_0 = const()[name = tensor<string, []>("key_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [768, 768, 1, 1]> layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [768, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7402752)))];
            tensor<fp16, [1, 768, 1, 1500]> key_1_cast_fp16 = conv(dilations = var_192, groups = var_151, pad = key_1_pad_0, pad_type = key_1_pad_type_0, strides = var_190, weight = layers_0_self_attn_k_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("key_1_cast_fp16")];
            tensor<int32, [2]> var_197 = const()[name = tensor<string, []>("op_197"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_199 = const()[name = tensor<string, []>("op_199"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> value_1_pad_type_0 = const()[name = tensor<string, []>("value_1_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> value_1_pad_0 = const()[name = tensor<string, []>("value_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [768, 768, 1, 1]> layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [768, 768, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(8582464)))];
            tensor<fp16, [768]> layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [768]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9762176)))];
            tensor<fp16, [1, 768, 1, 1500]> value_1_cast_fp16 = conv(bias = layers_0_self_attn_v_proj_bias_to_fp16, dilations = var_199, groups = var_151, pad = value_1_pad_0, pad_type = value_1_pad_type_0, strides = var_197, weight = layers_0_self_attn_v_proj_weight_to_fp16, x = obj_1_cast_fp16)[name = tensor<string, []>("value_1_cast_fp16")];
            tensor<int32, [4]> var_206_begin_0 = const()[name = tensor<string, []>("op_206_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_206_end_0 = const()[name = tensor<string, []>("op_206_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_206_end_mask_0 = const()[name = tensor<string, []>("op_206_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_206_cast_fp16 = slice_by_index(begin = var_206_begin_0, end = var_206_end_0, end_mask = var_206_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_206_cast_fp16")];
            tensor<int32, [4]> var_210_begin_0 = const()[name = tensor<string, []>("op_210_begin_0"), val = tensor<int32, [4]>([0, 64, 0, 0])];
            tensor<int32, [4]> var_210_end_0 = const()[name = tensor<string, []>("op_210_end_0"), val = tensor<int32, [4]>([1, 128, 1, 1500])];
            tensor<bool, [4]> var_210_end_mask_0 = const()[name = tensor<string, []>("op_210_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_210_cast_fp16 = slice_by_index(begin = var_210_begin_0, end = var_210_end_0, end_mask = var_210_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_210_cast_fp16")];
            tensor<int32, [4]> var_214_begin_0 = const()[name = tensor<string, []>("op_214_begin_0"), val = tensor<int32, [4]>([0, 128, 0, 0])];
            tensor<int32, [4]> var_214_end_0 = const()[name = tensor<string, []>("op_214_end_0"), val = tensor<int32, [4]>([1, 192, 1, 1500])];
            tensor<bool, [4]> var_214_end_mask_0 = const()[name = tensor<string, []>("op_214_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_214_cast_fp16 = slice_by_index(begin = var_214_begin_0, end = var_214_end_0, end_mask = var_214_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_214_cast_fp16")];
            tensor<int32, [4]> var_218_begin_0 = const()[name = tensor<string, []>("op_218_begin_0"), val = tensor<int32, [4]>([0, 192, 0, 0])];
            tensor<int32, [4]> var_218_end_0 = const()[name = tensor<string, []>("op_218_end_0"), val = tensor<int32, [4]>([1, 256, 1, 1500])];
            tensor<bool, [4]> var_218_end_mask_0 = const()[name = tensor<string, []>("op_218_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_218_cast_fp16 = slice_by_index(begin = var_218_begin_0, end = var_218_end_0, end_mask = var_218_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_218_cast_fp16")];
            tensor<int32, [4]> var_222_begin_0 = const()[name = tensor<string, []>("op_222_begin_0"), val = tensor<int32, [4]>([0, 256, 0, 0])];
            tensor<int32, [4]> var_222_end_0 = const()[name = tensor<string, []>("op_222_end_0"), val = tensor<int32, [4]>([1, 320, 1, 1500])];
            tensor<bool, [4]> var_222_end_mask_0 = const()[name = tensor<string, []>("op_222_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_222_cast_fp16 = slice_by_index(begin = var_222_begin_0, end = var_222_end_0, end_mask = var_222_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_222_cast_fp16")];
            tensor<int32, [4]> var_226_begin_0 = const()[name = tensor<string, []>("op_226_begin_0"), val = tensor<int32, [4]>([0, 320, 0, 0])];
            tensor<int32, [4]> var_226_end_0 = const()[name = tensor<string, []>("op_226_end_0"), val = tensor<int32, [4]>([1, 384, 1, 1500])];
            tensor<bool, [4]> var_226_end_mask_0 = const()[name = tensor<string, []>("op_226_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_226_cast_fp16 = slice_by_index(begin = var_226_begin_0, end = var_226_end_0, end_mask = var_226_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_226_cast_fp16")];
            tensor<int32, [4]> var_230_begin_0 = const()[name = tensor<string, []>("op_230_begin_0"), val = tensor<int32, [4]>([0, 384, 0, 0])];
            tensor<int32, [4]> var_230_end_0 = const()[name = tensor<string, []>("op_230_end_0"), val = tensor<int32, [4]>([1, 448, 1, 1500])];
            tensor<bool, [4]> var_230_end_mask_0 = const()[name = tensor<string, []>("op_230_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_230_cast_fp16 = slice_by_index(begin = var_230_begin_0, end = var_230_end_0, end_mask = var_230_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_230_cast_fp16")];
            tensor<int32, [4]> var_234_begin_0 = const()[name = tensor<string, []>("op_234_begin_0"), val = tensor<int32, [4]>([0, 448, 0, 0])];
            tensor<int32, [4]> var_234_end_0 = const()[name = tensor<string, []>("op_234_end_0"), val = tensor<int32, [4]>([1, 512, 1, 1500])];
            tensor<bool, [4]> var_234_end_mask_0 = const()[name = tensor<string, []>("op_234_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_234_cast_fp16 = slice_by_index(begin = var_234_begin_0, end = var_234_end_0, end_mask = var_234_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_234_cast_fp16")];
            tensor<int32, [4]> var_238_begin_0 = const()[name = tensor<string, []>("op_238_begin_0"), val = tensor<int32, [4]>([0, 512, 0, 0])];
            tensor<int32, [4]> var_238_end_0 = const()[name = tensor<string, []>("op_238_end_0"), val = tensor<int32, [4]>([1, 576, 1, 1500])];
            tensor<bool, [4]> var_238_end_mask_0 = const()[name = tensor<string, []>("op_238_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_238_cast_fp16 = slice_by_index(begin = var_238_begin_0, end = var_238_end_0, end_mask = var_238_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_238_cast_fp16")];
            tensor<int32, [4]> var_242_begin_0 = const()[name = tensor<string, []>("op_242_begin_0"), val = tensor<int32, [4]>([0, 576, 0, 0])];
            tensor<int32, [4]> var_242_end_0 = const()[name = tensor<string, []>("op_242_end_0"), val = tensor<int32, [4]>([1, 640, 1, 1500])];
            tensor<bool, [4]> var_242_end_mask_0 = const()[name = tensor<string, []>("op_242_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_242_cast_fp16 = slice_by_index(begin = var_242_begin_0, end = var_242_end_0, end_mask = var_242_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_242_cast_fp16")];
            tensor<int32, [4]> var_246_begin_0 = const()[name = tensor<string, []>("op_246_begin_0"), val = tensor<int32, [4]>([0, 640, 0, 0])];
            tensor<int32, [4]> var_246_end_0 = const()[name = tensor<string, []>("op_246_end_0"), val = tensor<int32, [4]>([1, 704, 1, 1500])];
            tensor<bool, [4]> var_246_end_mask_0 = const()[name = tensor<string, []>("op_246_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_246_cast_fp16 = slice_by_index(begin = var_246_begin_0, end = var_246_end_0, end_mask = var_246_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_246_cast_fp16")];
            tensor<int32, [4]> var_250_begin_0 = const()[name = tensor<string, []>("op_250_begin_0"), val = tensor<int32, [4]>([0, 704, 0, 0])];
            tensor<int32, [4]> var_250_end_0 = const()[name = tensor<string, []>("op_250_end_0"), val = tensor<int32, [4]>([1, 768, 1, 1500])];
            tensor<bool, [4]> var_250_end_mask_0 = const()[name = tensor<string, []>("op_250_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 64, 1, 1500]> var_250_cast_fp16 = slice_by_index(begin = var_250_begin_0, end = var_250_end_0, end_mask = var_250_end_mask_0, x = query_1_cast_fp16)[name = tensor<string, []>("op_250_cast_fp16")];
            tensor<int32, [4]> var_259_begin_0 = const()[name = tensor<string, []>("op_259_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_259_end_0 = const()[name = tensor<string, []>("op_259_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_259_end_mask_0 = const()[name = tensor<string, []>("op_259_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_259_cast_fp16 = slice_by_index(begin = var_259_begin_0, end = var_259_end_0, end_mask = var_259_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_259_cast_fp16")];
            tensor<int32, [4]> var_266_begin_0 = const()[name = tensor<string, []>("op_266_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_266_end_0 = const()[name = tensor<string, []>("op_266_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_266_end_mask_0 = const()[name = tensor<string, []>("op_266_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_266_cast_fp16 = slice_by_index(begin = var_266_begin_0, end = var_266_end_0, end_mask = var_266_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_266_cast_fp16")];
            tensor<int32, [4]> var_273_begin_0 = const()[name = tensor<string, []>("op_273_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_273_end_0 = const()[name = tensor<string, []>("op_273_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_273_end_mask_0 = const()[name = tensor<string, []>("op_273_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_273_cast_fp16 = slice_by_index(begin = var_273_begin_0, end = var_273_end_0, end_mask = var_273_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_273_cast_fp16")];
            tensor<int32, [4]> var_280_begin_0 = const()[name = tensor<string, []>("op_280_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_280_end_0 = const()[name = tensor<string, []>("op_280_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_280_end_mask_0 = const()[name = tensor<string, []>("op_280_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_280_cast_fp16 = slice_by_index(begin = var_280_begin_0, end = var_280_end_0, end_mask = var_280_end_mask_0, x = var_206_cast_fp16)[name = tensor<string, []>("op_280_cast_fp16")];
            tensor<int32, [4]> var_287_begin_0 = const()[name = tensor<string, []>("op_287_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_287_end_0 = const()[name = tensor<string, []>("op_287_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_287_end_mask_0 = const()[name = tensor<string, []>("op_287_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_287_cast_fp16 = slice_by_index(begin = var_287_begin_0, end = var_287_end_0, end_mask = var_287_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_287_cast_fp16")];
            tensor<int32, [4]> var_294_begin_0 = const()[name = tensor<string, []>("op_294_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_294_end_0 = const()[name = tensor<string, []>("op_294_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_294_end_mask_0 = const()[name = tensor<string, []>("op_294_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_294_cast_fp16 = slice_by_index(begin = var_294_begin_0, end = var_294_end_0, end_mask = var_294_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_294_cast_fp16")];
            tensor<int32, [4]> var_301_begin_0 = const()[name = tensor<string, []>("op_301_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_301_end_0 = const()[name = tensor<string, []>("op_301_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_301_end_mask_0 = const()[name = tensor<string, []>("op_301_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_301_cast_fp16 = slice_by_index(begin = var_301_begin_0, end = var_301_end_0, end_mask = var_301_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_301_cast_fp16")];
            tensor<int32, [4]> var_308_begin_0 = const()[name = tensor<string, []>("op_308_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_308_end_0 = const()[name = tensor<string, []>("op_308_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_308_end_mask_0 = const()[name = tensor<string, []>("op_308_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_308_cast_fp16 = slice_by_index(begin = var_308_begin_0, end = var_308_end_0, end_mask = var_308_end_mask_0, x = var_210_cast_fp16)[name = tensor<string, []>("op_308_cast_fp16")];
            tensor<int32, [4]> var_315_begin_0 = const()[name = tensor<string, []>("op_315_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_315_end_0 = const()[name = tensor<string, []>("op_315_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_315_end_mask_0 = const()[name = tensor<string, []>("op_315_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_315_cast_fp16 = slice_by_index(begin = var_315_begin_0, end = var_315_end_0, end_mask = var_315_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_315_cast_fp16")];
            tensor<int32, [4]> var_322_begin_0 = const()[name = tensor<string, []>("op_322_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_322_end_0 = const()[name = tensor<string, []>("op_322_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_322_end_mask_0 = const()[name = tensor<string, []>("op_322_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_322_cast_fp16 = slice_by_index(begin = var_322_begin_0, end = var_322_end_0, end_mask = var_322_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_322_cast_fp16")];
            tensor<int32, [4]> var_329_begin_0 = const()[name = tensor<string, []>("op_329_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_329_end_0 = const()[name = tensor<string, []>("op_329_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_329_end_mask_0 = const()[name = tensor<string, []>("op_329_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_329_cast_fp16 = slice_by_index(begin = var_329_begin_0, end = var_329_end_0, end_mask = var_329_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_329_cast_fp16")];
            tensor<int32, [4]> var_336_begin_0 = const()[name = tensor<string, []>("op_336_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_336_end_0 = const()[name = tensor<string, []>("op_336_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_336_end_mask_0 = const()[name = tensor<string, []>("op_336_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_336_cast_fp16 = slice_by_index(begin = var_336_begin_0, end = var_336_end_0, end_mask = var_336_end_mask_0, x = var_214_cast_fp16)[name = tensor<string, []>("op_336_cast_fp16")];
            tensor<int32, [4]> var_343_begin_0 = const()[name = tensor<string, []>("op_343_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_343_end_0 = const()[name = tensor<string, []>("op_343_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_343_end_mask_0 = const()[name = tensor<string, []>("op_343_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_343_cast_fp16 = slice_by_index(begin = var_343_begin_0, end = var_343_end_0, end_mask = var_343_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_343_cast_fp16")];
            tensor<int32, [4]> var_350_begin_0 = const()[name = tensor<string, []>("op_350_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_350_end_0 = const()[name = tensor<string, []>("op_350_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_350_end_mask_0 = const()[name = tensor<string, []>("op_350_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_350_cast_fp16 = slice_by_index(begin = var_350_begin_0, end = var_350_end_0, end_mask = var_350_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_350_cast_fp16")];
            tensor<int32, [4]> var_357_begin_0 = const()[name = tensor<string, []>("op_357_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_357_end_0 = const()[name = tensor<string, []>("op_357_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_357_end_mask_0 = const()[name = tensor<string, []>("op_357_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_357_cast_fp16 = slice_by_index(begin = var_357_begin_0, end = var_357_end_0, end_mask = var_357_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_357_cast_fp16")];
            tensor<int32, [4]> var_364_begin_0 = const()[name = tensor<string, []>("op_364_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_364_end_0 = const()[name = tensor<string, []>("op_364_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_364_end_mask_0 = const()[name = tensor<string, []>("op_364_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_364_cast_fp16 = slice_by_index(begin = var_364_begin_0, end = var_364_end_0, end_mask = var_364_end_mask_0, x = var_218_cast_fp16)[name = tensor<string, []>("op_364_cast_fp16")];
            tensor<int32, [4]> var_371_begin_0 = const()[name = tensor<string, []>("op_371_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_371_end_0 = const()[name = tensor<string, []>("op_371_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_371_end_mask_0 = const()[name = tensor<string, []>("op_371_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_371_cast_fp16 = slice_by_index(begin = var_371_begin_0, end = var_371_end_0, end_mask = var_371_end_mask_0, x = var_222_cast_fp16)[name = tensor<string, []>("op_371_cast_fp16")];
            tensor<int32, [4]> var_378_begin_0 = const()[name = tensor<string, []>("op_378_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_378_end_0 = const()[name = tensor<string, []>("op_378_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_378_end_mask_0 = const()[name = tensor<string, []>("op_378_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_378_cast_fp16 = slice_by_index(begin = var_378_begin_0, end = var_378_end_0, end_mask = var_378_end_mask_0, x = var_222_cast_fp16)[name = tensor<string, []>("op_378_cast_fp16")];
            tensor<int32, [4]> var_385_begin_0 = const()[name = tensor<string, []>("op_385_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_385_end_0 = const()[name = tensor<string, []>("op_385_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_385_end_mask_0 = const()[name = tensor<string, []>("op_385_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_385_cast_fp16 = slice_by_index(begin = var_385_begin_0, end = var_385_end_0, end_mask = var_385_end_mask_0, x = var_222_cast_fp16)[name = tensor<string, []>("op_385_cast_fp16")];
            tensor<int32, [4]> var_392_begin_0 = const()[name = tensor<string, []>("op_392_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_392_end_0 = const()[name = tensor<string, []>("op_392_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_392_end_mask_0 = const()[name = tensor<string, []>("op_392_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_392_cast_fp16 = slice_by_index(begin = var_392_begin_0, end = var_392_end_0, end_mask = var_392_end_mask_0, x = var_222_cast_fp16)[name = tensor<string, []>("op_392_cast_fp16")];
            tensor<int32, [4]> var_399_begin_0 = const()[name = tensor<string, []>("op_399_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_399_end_0 = const()[name = tensor<string, []>("op_399_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_399_end_mask_0 = const()[name = tensor<string, []>("op_399_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_399_cast_fp16 = slice_by_index(begin = var_399_begin_0, end = var_399_end_0, end_mask = var_399_end_mask_0, x = var_226_cast_fp16)[name = tensor<string, []>("op_399_cast_fp16")];
            tensor<int32, [4]> var_406_begin_0 = const()[name = tensor<string, []>("op_406_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_406_end_0 = const()[name = tensor<string, []>("op_406_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_406_end_mask_0 = const()[name = tensor<string, []>("op_406_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_406_cast_fp16 = slice_by_index(begin = var_406_begin_0, end = var_406_end_0, end_mask = var_406_end_mask_0, x = var_226_cast_fp16)[name = tensor<string, []>("op_406_cast_fp16")];
            tensor<int32, [4]> var_413_begin_0 = const()[name = tensor<string, []>("op_413_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_413_end_0 = const()[name = tensor<string, []>("op_413_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_413_end_mask_0 = const()[name = tensor<string, []>("op_413_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_413_cast_fp16 = slice_by_index(begin = var_413_begin_0, end = var_413_end_0, end_mask = var_413_end_mask_0, x = var_226_cast_fp16)[name = tensor<string, []>("op_413_cast_fp16")];
            tensor<int32, [4]> var_420_begin_0 = const()[name = tensor<string, []>("op_420_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_420_end_0 = const()[name = tensor<string, []>("op_420_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_420_end_mask_0 = const()[name = tensor<string, []>("op_420_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_420_cast_fp16 = slice_by_index(begin = var_420_begin_0, end = var_420_end_0, end_mask = var_420_end_mask_0, x = var_226_cast_fp16)[name = tensor<string, []>("op_420_cast_fp16")];
            tensor<int32, [4]> var_427_begin_0 = const()[name = tensor<string, []>("op_427_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_427_end_0 = const()[name = tensor<string, []>("op_427_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_427_end_mask_0 = const()[name = tensor<string, []>("op_427_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_427_cast_fp16 = slice_by_index(begin = var_427_begin_0, end = var_427_end_0, end_mask = var_427_end_mask_0, x = var_230_cast_fp16)[name = tensor<string, []>("op_427_cast_fp16")];
            tensor<int32, [4]> var_434_begin_0 = const()[name = tensor<string, []>("op_434_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_434_end_0 = const()[name = tensor<string, []>("op_434_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_434_end_mask_0 = const()[name = tensor<string, []>("op_434_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_434_cast_fp16 = slice_by_index(begin = var_434_begin_0, end = var_434_end_0, end_mask = var_434_end_mask_0, x = var_230_cast_fp16)[name = tensor<string, []>("op_434_cast_fp16")];
            tensor<int32, [4]> var_441_begin_0 = const()[name = tensor<string, []>("op_441_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_441_end_0 = const()[name = tensor<string, []>("op_441_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_441_end_mask_0 = const()[name = tensor<string, []>("op_441_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_441_cast_fp16 = slice_by_index(begin = var_441_begin_0, end = var_441_end_0, end_mask = var_441_end_mask_0, x = var_230_cast_fp16)[name = tensor<string, []>("op_441_cast_fp16")];
            tensor<int32, [4]> var_448_begin_0 = const()[name = tensor<string, []>("op_448_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_448_end_0 = const()[name = tensor<string, []>("op_448_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_448_end_mask_0 = const()[name = tensor<string, []>("op_448_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_448_cast_fp16 = slice_by_index(begin = var_448_begin_0, end = var_448_end_0, end_mask = var_448_end_mask_0, x = var_230_cast_fp16)[name = tensor<string, []>("op_448_cast_fp16")];
            tensor<int32, [4]> var_455_begin_0 = const()[name = tensor<string, []>("op_455_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_455_end_0 = const()[name = tensor<string, []>("op_455_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_455_end_mask_0 = const()[name = tensor<string, []>("op_455_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_455_cast_fp16 = slice_by_index(begin = var_455_begin_0, end = var_455_end_0, end_mask = var_455_end_mask_0, x = var_234_cast_fp16)[name = tensor<string, []>("op_455_cast_fp16")];
            tensor<int32, [4]> var_462_begin_0 = const()[name = tensor<string, []>("op_462_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_462_end_0 = const()[name = tensor<string, []>("op_462_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_462_end_mask_0 = const()[name = tensor<string, []>("op_462_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_462_cast_fp16 = slice_by_index(begin = var_462_begin_0, end = var_462_end_0, end_mask = var_462_end_mask_0, x = var_234_cast_fp16)[name = tensor<string, []>("op_462_cast_fp16")];
            tensor<int32, [4]> var_469_begin_0 = const()[name = tensor<string, []>("op_469_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_469_end_0 = const()[name = tensor<string, []>("op_469_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_469_end_mask_0 = const()[name = tensor<string, []>("op_469_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_469_cast_fp16 = slice_by_index(begin = var_469_begin_0, end = var_469_end_0, end_mask = var_469_end_mask_0, x = var_234_cast_fp16)[name = tensor<string, []>("op_469_cast_fp16")];
            tensor<int32, [4]> var_476_begin_0 = const()[name = tensor<string, []>("op_476_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_476_end_0 = const()[name = tensor<string, []>("op_476_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_476_end_mask_0 = const()[name = tensor<string, []>("op_476_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_476_cast_fp16 = slice_by_index(begin = var_476_begin_0, end = var_476_end_0, end_mask = var_476_end_mask_0, x = var_234_cast_fp16)[name = tensor<string, []>("op_476_cast_fp16")];
            tensor<int32, [4]> var_483_begin_0 = const()[name = tensor<string, []>("op_483_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_483_end_0 = const()[name = tensor<string, []>("op_483_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_483_end_mask_0 = const()[name = tensor<string, []>("op_483_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_483_cast_fp16 = slice_by_index(begin = var_483_begin_0, end = var_483_end_0, end_mask = var_483_end_mask_0, x = var_238_cast_fp16)[name = tensor<string, []>("op_483_cast_fp16")];
            tensor<int32, [4]> var_490_begin_0 = const()[name = tensor<string, []>("op_490_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_490_end_0 = const()[name = tensor<string, []>("op_490_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_490_end_mask_0 = const()[name = tensor<string, []>("op_490_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_490_cast_fp16 = slice_by_index(begin = var_490_begin_0, end = var_490_end_0, end_mask = var_490_end_mask_0, x = var_238_cast_fp16)[name = tensor<string, []>("op_490_cast_fp16")];
            tensor<int32, [4]> var_497_begin_0 = const()[name = tensor<string, []>("op_497_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_497_end_0 = const()[name = tensor<string, []>("op_497_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_497_end_mask_0 = const()[name = tensor<string, []>("op_497_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_497_cast_fp16 = slice_by_index(begin = var_497_begin_0, end = var_497_end_0, end_mask = var_497_end_mask_0, x = var_238_cast_fp16)[name = tensor<string, []>("op_497_cast_fp16")];
            tensor<int32, [4]> var_504_begin_0 = const()[name = tensor<string, []>("op_504_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_504_end_0 = const()[name = tensor<string, []>("op_504_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_504_end_mask_0 = const()[name = tensor<string, []>("op_504_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_504_cast_fp16 = slice_by_index(begin = var_504_begin_0, end = var_504_end_0, end_mask = var_504_end_mask_0, x = var_238_cast_fp16)[name = tensor<string, []>("op_504_cast_fp16")];
            tensor<int32, [4]> var_511_begin_0 = const()[name = tensor<string, []>("op_511_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_511_end_0 = const()[name = tensor<string, []>("op_511_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_511_end_mask_0 = const()[name = tensor<string, []>("op_511_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_511_cast_fp16 = slice_by_index(begin = var_511_begin_0, end = var_511_end_0, end_mask = var_511_end_mask_0, x = var_242_cast_fp16)[name = tensor<string, []>("op_511_cast_fp16")];
            tensor<int32, [4]> var_518_begin_0 = const()[name = tensor<string, []>("op_518_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_518_end_0 = const()[name = tensor<string, []>("op_518_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_518_end_mask_0 = const()[name = tensor<string, []>("op_518_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_518_cast_fp16 = slice_by_index(begin = var_518_begin_0, end = var_518_end_0, end_mask = var_518_end_mask_0, x = var_242_cast_fp16)[name = tensor<string, []>("op_518_cast_fp16")];
            tensor<int32, [4]> var_525_begin_0 = const()[name = tensor<string, []>("op_525_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_525_end_0 = const()[name = tensor<string, []>("op_525_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_525_end_mask_0 = const()[name = tensor<string, []>("op_525_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_525_cast_fp16 = slice_by_index(begin = var_525_begin_0, end = var_525_end_0, end_mask = var_525_end_mask_0, x = var_242_cast_fp16)[name = tensor<string, []>("op_525_cast_fp16")];
            tensor<int32, [4]> var_532_begin_0 = const()[name = tensor<string, []>("op_532_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_532_end_0 = const()[name = tensor<string, []>("op_532_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_532_end_mask_0 = const()[name = tensor<string, []>("op_532_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_532_cast_fp16 = slice_by_index(begin = var_532_begin_0, end = var_532_end_0, end_mask = var_532_end_mask_0, x = var_242_cast_fp16)[name = tensor<string, []>("op_532_cast_fp16")];
            tensor<int32, [4]> var_539_begin_0 = const()[name = tensor<string, []>("op_539_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_539_end_0 = const()[name = tensor<string, []>("op_539_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
            tensor<bool, [4]> var_539_end_mask_0 = const()[name = tensor<string, []>("op_539_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_539_cast_fp16 = slice_by_index(begin = var_539_begin_0, end = var_539_end_0, end_mask = var_539_end_mask_0, x = var_246_cast_fp16)[name = tensor<string, []>("op_539_cast_fp16")];
            tensor<int32, [4]> var_546_begin_0 = const()[name = tensor<string, []>("op_546_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 375])];
            tensor<int32, [4]> var_546_end_0 = const()[name = tensor<string, []>("op_546_end_0"), val = tensor<int32, [4]>([1, 64, 1, 750])];
            tensor<bool, [4]> var_546_end_mask_0 = const()[name = tensor<string, []>("op_546_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_546_cast_fp16 = slice_by_index(begin = var_546_begin_0, end = var_546_end_0, end_mask = var_546_end_mask_0, x = var_246_cast_fp16)[name = tensor<string, []>("op_546_cast_fp16")];
            tensor<int32, [4]> var_553_begin_0 = const()[name = tensor<string, []>("op_553_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 750])];
            tensor<int32, [4]> var_553_end_0 = const()[name = tensor<string, []>("op_553_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1125])];
            tensor<bool, [4]> var_553_end_mask_0 = const()[name = tensor<string, []>("op_553_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_553_cast_fp16 = slice_by_index(begin = var_553_begin_0, end = var_553_end_0, end_mask = var_553_end_mask_0, x = var_246_cast_fp16)[name = tensor<string, []>("op_553_cast_fp16")];
            tensor<int32, [4]> var_560_begin_0 = const()[name = tensor<string, []>("op_560_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 1125])];
            tensor<int32, [4]> var_560_end_0 = const()[name = tensor<string, []>("op_560_end_0"), val = tensor<int32, [4]>([1, 64, 1, 1500])];
            tensor<bool, [4]> var_560_end_mask_0 = const()[name = tensor<string, []>("op_560_end_mask_0"), val = tensor<bool, [4]>([true, true, true, false])];
            tensor<fp16, [1, 64, 1, 375]> var_560_cast_fp16 = slice_by_index(begin = var_560_begin_0, end = var_560_end_0, end_mask = var_560_end_mask_0, x = var_246_cast_fp16)[name = tensor<string, []>("op_560_cast_fp16")];
            tensor<int32, [4]> var_567_begin_0 = const()[name = tensor<string, []>("op_567_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_567_end_0 = const()[name = tensor<string, []>("op_567_end_0"), val = tensor<int32, [4]>([1, 64, 1, 375])];
